<a href="https://colab.research.google.com/github/imutsaw/python/blob/main/p4_(LOCv_sILOC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
#creating our own dataframe
data = pd.DataFrame({
    'Name':    ['sarthak', 'sonali', 'pratham', 'pratima','somesh','aquib'],
    'Section': ['A','B','A','B','B','A'],
    'Marks':   [90, 100, 75, 70, 60, 95],
    'Gender':  ['M', 'F', 'M', 'F', 'M', 'M'],
    'Stream':  ['comm', 'science', 'comm', 'arts', np.NAN,'arts']
})

#viewing of data
data

      Name Section  Marks Gender   Stream
0  sarthak       A     90      M     comm
1   sonali       B    100      F  science
2  pratham       A     75      M     comm
3  pratima       B     70      F     arts
4   somesh       B     60      M      NaN
5    aquib       A     95      M     arts

In [3]:
data.loc[2:4,['Name','Marks']]

      Name  Marks
2  pratham     75
3  pratima     70
4   somesh     60

In [5]:
data.iloc[2:4,[0,2]]

      Name  Marks
2  pratham     75
3  pratima     70

In [6]:
data.loc[data.Marks > 75 ]

      Name Section  Marks Gender   Stream
0  sarthak       A     90      M     comm
1   sonali       B    100      F  science
5    aquib       A     95      M     arts

In [7]:
#select with multiple conditions
data.loc[(data.Marks >= 70) & (data.Gender == 'M')]

      Name Section  Marks Gender Stream
0  sarthak       A     90      M   comm
2  pratham       A     75      M   comm
5    aquib       A     95      M   arts

In [8]:
#Slicing
data.loc[1:3]

      Name Section  Marks Gender   Stream
1   sonali       B    100      F  science
2  pratham       A     75      M     comm
3  pratima       B     70      F     arts

In [9]:
#select few columns with a condition
data.loc[(data.Marks >= 70),['Gender','Stream']]

  Gender   Stream
0      M     comm
1      F  science
2      M     comm
3      F     arts
5      M     arts

In [10]:
#Update a column with condition
data.loc[(data.Marks > 75),['Section']]='C'
data

      Name Section  Marks Gender   Stream
0  sarthak       C     90      M     comm
1   sonali       C    100      F  science
2  pratham       A     75      M     comm
3  pratima       B     70      F     arts
4   somesh       B     60      M      NaN
5    aquib       C     95      M     arts

In [12]:
#update multiple columns with condition
data.loc[(data.Marks >=75), ['Section','Stream']] = ['T', 'Science']
data

      Name Section  Marks Gender   Stream
0  sarthak       T     90      M  Science
1   sonali       T    100      F  Science
2  pratham       T     75      M  Science
3  pratima       B     70      F     arts
4   somesh       B     60      M      NaN
5    aquib       T     95      M  Science

In [16]:
#Select Rows with indexes
data.iloc[[0,2]]

      Name Section  Marks Gender   Stream
0  sarthak       T     90      M  Science
2  pratham       T     75      M  Science

In [17]:
#Select rows with particular indexes and particuar columns
data.iloc[[0,2],[1,3]]

  Section Gender
0       T      M
2       T      M

In [18]:
#indexing
data.iloc[1:3]

      Name Section  Marks Gender   Stream
1   sonali       T    100      F  Science
2  pratham       T     75      M  Science

In [19]:
#select a range of rows and columns
data.iloc[1:3,2:4]

   Marks Gender
1    100      F
2     75      M

In [20]:
data.iloc[[0,2,4]]

      Name Section  Marks Gender   Stream
0  sarthak       T     90      M  Science
2  pratham       T     75      M  Science
4   somesh       B     60      M      NaN

In [21]:
# importing the module 
import pandas as pd

In [22]:
# creating a sample dataframe 
data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Year' : [2012, 2014, 2011, 2015, 2012,  
                               2016, 2014, 2018, 2019], 
                     'Kms Driven' : [50000, 30000, 60000,  
                                     25000, 10000, 46000,  
                                     31000, 15000, 12000], 
                     'City' : ['Gurgaon', 'Delhi', 'Mumbai',  
                               'Delhi', 'Mumbai', 'Delhi',  
                               'Mumbai','Chennai',  'Ghaziabad'], 
                     'Mileage' :  [28, 27, 25, 26, 28,  
                                   29, 24, 21, 24]}) 
   
# displaying the DataFrame 
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [23]:
# selecting cars with brand 'Maruti' and Mileage > 25 
display(data.loc[(data.Brand == 'Maruti') & (data.Mileage > 25)])

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [24]:
# selecting range of rows from 2 to 5 
display(data.loc[2 : 5])

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       25
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       28
5   Hyundai  2016       46000   Delhi       29